In [68]:
from google.colab import drive
drive.mount('/gdrive', force_remount=True)

Mounted at /gdrive

In [69]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt

In [70]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [48]:
df1 = '/content/drive/MyDrive/4조_헬스케어/자료파일/raw_data/중증도보정입원의료사망비.csv'
df1 = pd.read_csv(df1, encoding="euc-kr")
df1.head(3)

   지표연도  \t시도코드    \t시도명  \t구분  \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
0  2017      11  \t서울특별시  \t권내  \t전체  ...    \t전체   11955    14296    84.0    84.0
1  2019      11  \t서울특별시  \t권외  \t전체  ...    \t전체    2599     2263   115.0   115.0
2  2019      11  \t서울특별시  \t권내  \t전체  ...    \t전체    3792     4358    87.0    87.0

[3 rows x 11 columns]

In [49]:
df1.columns

Index(['지표연도', '\t시도코드', '\t시도명', '\t구분', '\t성별', '\t연령대', '\t보험료구분',
       '\t이벤트건수', '\t대상자건수', '\t지표비율', '\t표준화율'],
      dtype='object')

In [50]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 453 entries, 0 to 452
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지표연도    453 non-null    int64
 1   	시도코드   453 non-null    int64
 2   	시도명    453 non-null    object
 3   	구분     453 non-null    object
 4   	성별     453 non-null    object
 5   	연령대    453 non-null    object
 6   	보험료구분  453 non-null    object
 7   	이벤트건수  453 non-null    int64
 8   	대상자건수  453 non-null    int64
 9   	지표비율   453 non-null    float64
 10  	표준화율   453 non-null    float64
dtypes: float64(2), int64(4), object(5)
memory usage: 39.1+ KB

In [51]:
df1 = df1.replace(r'\W+', '', regex=True)
df1.head()

   지표연도  \t시도코드  \t시도명 \t구분 \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
0  2017      11  서울특별시   권내   전체  ...      전체   11955    14296    84.0    84.0
1  2019      11  서울특별시   권외   전체  ...      전체    2599     2263   115.0   115.0
2  2019      11  서울특별시   권내   전체  ...      전체    3792     4358    87.0    87.0
3  2019      11  서울특별시   전체   전체  ...      전체    6391     6410   100.0   100.0
4  2018      11  서울특별시   권외   전체  ...      전체    7053     6337   111.0   111.0

[5 rows x 11 columns]

In [52]:
df1 = df1[df1.지표연도 == 2019]
df1.head()

    지표연도  \t시도코드  \t시도명 \t구분 \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
1   2019      11  서울특별시   권외   전체  ...      전체    2599     2263   115.0   115.0
2   2019      11  서울특별시   권내   전체  ...      전체    3792     4358    87.0    87.0
3   2019      11  서울특별시   전체   전체  ...      전체    6391     6410   100.0   100.0
36  2019      21  부산광역시   전체   전체  ...      전체    2418     2913    83.0    83.0
37  2019      21  부산광역시   권내   전체  ...      전체    1215     1663    73.0    73.0

[5 rows x 11 columns]

In [53]:
df1.rename(columns={'\t구분':'구분'},inplace=True)
df1.head(3)

   지표연도  \t시도코드  \t시도명  구분 \t성별 \t연령대 \t보험료구분  \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
1  2019      11  서울특별시  권외   전체    전체      전체     2599     2263   115.0   115.0
2  2019      11  서울특별시  권내   전체    전체      전체     3792     4358    87.0    87.0
3  2019      11  서울특별시  전체   전체    전체      전체     6391     6410   100.0   100.0

In [60]:
df1.rename(columns={'\t시도코드':'시도코드'},inplace=True)
df1.rename(columns={'\t시도명':'시도명'},inplace=True)
df1.rename(columns={'\t대상자건수':'대상자건수'},inplace=True)
df1.rename(columns={'\t지표비율':'지표비율'},inplace=True)

In [61]:
df1 = df1[df1.구분 == '전체']
df1.head()

     지표연도  시도코드    시도명  구분 \t성별 \t연령대 \t보험료구분  \t이벤트건수  대상자건수   지표비율  \t표준화율
3    2019    11  서울특별시  전체   전체    전체      전체     6391   6410  100.0   100.0
36   2019    21  부산광역시  전체   전체    전체      전체     2418   2913   83.0    83.0
63   2019    22  대구광역시  전체   전체    전체      전체     1650   1491  111.0   111.0
84   2019    23  인천광역시  전체   전체    전체      전체     1885   1938   97.0    97.0
117  2019    24  광주광역시  전체   전체    전체      전체      814    904   90.0    90.0

In [66]:
df1 = df1[['시도코드', '시도명', '대상자건수', '지표비율']]
df1.head()

   시도코드    시도명  대상자건수   지표비율
0    11  서울특별시   6410  100.0
1    21  부산광역시   2913   83.0
2    22  대구광역시   1491  111.0
3    23  인천광역시   1938   97.0
4    24  광주광역시    904   90.0

In [63]:
df1.to_csv('회피가능사망율.csv')

- KOSIS 데이터

In [88]:
df2 = '/content/drive/MyDrive/4조_헬스케어/자료파일/raw_data/의료기관_소재지별_치료가능_사망률_2015.csv'
df2 = pd.read_csv(df2, header=2, encoding="euc-kr")
df2.head(3)

   전국  69.3  50.4
0  서울  59.1  44.6
1  부산  75.2  55.3
2  대구  76.2  54.2

In [89]:
df2 = df2[['전국', '50.4']]
# index reset 
df2 = df2.reset_index(drop=True)
df2.head(3)

   전국  50.4
0  서울  44.6
1  부산  55.3
2  대구  54.2

In [90]:
df2.rename(columns={'전국':'시도명'},inplace=True)
df2.rename(columns={'50.4':'사망률'},inplace=True)
df2.head(3)

  시도명   사망률
0  서울  44.6
1  부산  55.3
2  대구  54.2

In [91]:
df2.replace(['서울', '부산', '인천', '대구', '광주', '대전', '울산', '경기', '강원', '충북', '충남',
       '전북', '전남', '경북', '경남', '제주', '세종'],
       ['11', '21', '23', '22', '24', '25', '26', '31', '32',
       '33', '34', '35', '36', '37', '38', '39', '29'],inplace=True)

In [92]:
df2.head(3)

  시도명   사망률
0  11  44.6
1  21  55.3
2  22  54.2

In [93]:
df2.to_csv('회피가능사망율(KOSIS).csv')